---
title: DECR
description: DECR decrements the value of the specified key in args by 1
---

<!-- This file is automatically generated. Any modifications made directly to this file
  may be overwritten. For more details on how this file is generated and how to use
  the related commands, refer to the documentation available in the `internal/cmd/cmd_*.go` files.
-->

#### Syntax

```
DECR key
```


DECR command decrements the integer at 'key' by one. Creates 'key' as -1 if absent.
The command raises an error if the value is a non-integer.

Returns the new value of 'key' on success.
	

#### Examples

```

localhost:7379> SET k 43
OK
localhost:7379> DECR k
OK 42
localhost:7379> DECR k1
OK -1
localhost:7379> SET k2 v
OK
localhost:7379> DECR k2
ERR wrongtype operation against a key holding the wrong kind of value
	
```
