---
title: EXPIRE
description: EXPIRE sets an expiry (in seconds) on a specified key
---

<!-- This file is automatically generated. Any modifications made directly to this file
  may be overwritten. For more details on how this file is generated and how to use
  the related commands, refer to the documentation available in the `internal/cmd/cmd_*.go` files.
-->

#### Syntax

```
EXPIRE key seconds [NX | XX]
```


EXPIRE sets an expiry (in seconds) on a specified key. After the expiry time has elapsed, the key will be automatically deleted.

> If you want to delete the expiration time on the key, you can use the PERSIST command.

The command returns 1 if the expiry was set, and 0 if the key already had an expiry set. The command supports the following options:

- NX: Set the expiration only if the key does not already have an expiration time.
- XX: Set the expiration only if the key already has an expiration time.
	

#### Examples

```

locahost:7379> SET k1 v1
OK OK
locahost:7379> EXPIRE k1 10
OK 1
locahost:7379> SET k2 v2
OK OK
locahost:7379> EXPIRE k2 10 NX
OK 1
locahost:7379> EXPIRE k2 20 XX
OK 1
locahost:7379> EXPIRE k2 20 NX
OK 0
	
```
